--- a/README.md
+++ b/README.md
@@ -515,53 +639,43 @@ The `ucan` scheme MUST accept the following ability: `ucan/*`. This ability rede
-The "top" (or "super user") ability MUST be denoted `*`. The top ability grants access to all other capabilities for the specified resource, across all possible namespaces. Top corresponds to an "all" matcher, whereas [delegation](#51-ucan-delegation) corresponds to "any" in the UCAN chain. The top ability is useful when "linking" agents by delegating all access to resource(s). This is the most powerful ability, and as such it SHOULD be handled with care.
+The "top" (or "super user") ability MUST be denoted `*`. The top ability grants access to all other capabilities for the specified resource, across all possible namespaces. Top corresponds to an "all" matcher, whereas [delegation] corresponds to "any" in the UCAN chain. The top ability is useful when "linking" agents by delegating all access to resource(s). This is the most powerful ability, and as such it SHOULD be handled with care.
 
+``` mermaid
+%%{ init: { 'flowchart': { 'curve': 'linear' } } }%%
+
+flowchart BT
+  *
+
+  msg/* --> *
+  subgraph msgGraph [ ]
+    msg/send --> msg/*
+    msg/receive --> msg/*
+  end
+
+  crud/* --> *
+  subgraph crudGraph [ ]
+    crud/read --> crud/*
+    crud/mutate --> crud/*
+
+    subgraph mutationGraph [ ]
+        crud/create --> crud/mutate
+        crud/update --> crud/mutate
+        crud/destroy --> crud/mutate
+    end
+  end
+
+  ... --> *
 ```
-                                           ┌───────┐
-                                           │       │
-                                           │   *   │
-                                           │       │
-                                           └▲──▲──▲┘
-                                            │  │  │
-               ┌────────────────────────────┘  │  └────────────────────────────┐
-               │                               │                               │
-          ┌────┴────┐                     ┌────┴─────┐                     ┌───┴───┐
-          │         │                     │          │                     │       │
-          │  msg/*  │                     │  crud/*  │                     │  ...  │
-          │         │                     │          │                     │       │
-          └─▲─────▲─┘                     └─▲──────▲─┘                     └───────┘
-            │     │                         │      │
-            │     │                         │      │
-            │     │                         │      │
-┌───────────┴┐ ┌──┴────────────┐ ┌──────────┴──┐ ┌─┴─────────────┐
-│            │ │               │ │             │ │               │
-│  msg/send  │ │  msg/receive  │ │  crud/read  │ │  crud/mutate  │
-│            │ │               │ │             │ │               │
-└────────────┘ └───────────────┘ └─────────────┘ └─▲─────▲─────▲─┘
-                                                   │     │     │
-                                            ┌──────┘     │     └──────┐
-                                            │            │            │
-                               ┌────────────┴──┐ ┌───────┴───────┐ ┌──┴─────────────┐
-                               │               │ │               │ │                │
-                               │  crud/create  │ │  crud/update  │ │  crud/destroy  │
-                               │               │ │               │ │                │
-                               └───────────────┘ └───────────────┘ └────────────────┘
-```
+
 
 ### 5.2.1 Bottom
